cmsis-svd/cmsis-svd/data/TexasInstruments/TM4C1233H6PZ.svd
        <register>
          <name>SAC</name>
          <description>ADC Sample Averaging Control</description>
          <addressOffset>0x00000030</addressOffset>
          <fields>
            <field>
              <name>ADC_SAC_AVG</name>
              <description>Hardware Averaging Control</description>
              <bitRange>[2:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC_SAC_AVG_OFF</name>
                  <description>No hardware oversampling</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_SAC_AVG_2X</name>
                  <description>2x hardware oversampling</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_SAC_AVG_4X</name>
                  <description>4x hardware oversampling</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_SAC_AVG_8X</name>
                  <description>8x hardware oversampling</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_SAC_AVG_16X</name>
                  <description>16x hardware oversampling</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_SAC_AVG_32X</name>
                  <description>32x hardware oversampling</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_SAC_AVG_64X</name>
                  <description>64x hardware oversampling</description>
                  <value>0x6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DCISC</name>
          <description>ADC Digital Comparator Interrupt Status and Clear</description>
          <addressOffset>0x00000034</addressOffset>
          <fields>
            <field>
              <name>ADC_DCISC_DCINT0</name>
              <description>Digital Comparator 0 Interrupt Status and Clear</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ADC_DCISC_DCINT1</name>
              <description>Digital Comparator 1 Interrupt Status and Clear</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>ADC_DCISC_DCINT2</name>
              <description>Digital Comparator 2 Interrupt Status and Clear</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>ADC_DCISC_DCINT3</name>
              <description>Digital Comparator 3 Interrupt Status and Clear</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>ADC_DCISC_DCINT4</name>
              <description>Digital Comparator 4 Interrupt Status and Clear</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>ADC_DCISC_DCINT5</name>
              <description>Digital Comparator 5 Interrupt Status and Clear</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>ADC_DCISC_DCINT6</name>
              <description>Digital Comparator 6 Interrupt Status and Clear</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>ADC_DCISC_DCINT7</name>
              <description>Digital Comparator 7 Interrupt Status and Clear</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CTL</name>
          <description>ADC Control</description>
          <addressOffset>0x00000038</addressOffset>
          <fields>
            <field>
              <name>ADC_CTL_VREF</name>
              <description>Voltage Reference Select</description>
              <bitRange>[1:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC_CTL_VREF_INTERNAL</name>
                  <description>The internal reference as the voltage reference</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_CTL_VREF_EXT_3V</name>
                  <description>A 3.0 V external VREFA input is the voltage reference. The ADC conversion range is 0.0 V to the external reference value</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC_CTL_DITHER</name>
              <description>Dither Mode Enable</description>
              <bitRange>[6:6]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SSMUX0</name>
          <description>ADC Sample Sequence Input Multiplexer Select 0</description>
          <addressOffset>0x00000040</addressOffset>
          <fields>
            <field>
              <name>ADC_SSMUX0_MUX0</name>
              <description>1st Sample Input Select</description>
              <bitRange>[3:0]</bitRange>
            </field>
            <field>
              <name>ADC_SSMUX0_MUX1</name>
              <description>2nd Sample Input Select</description>
              <bitRange>[7:4]</bitRange>
            </field>
            <field>
              <name>ADC_SSMUX0_MUX2</name>
              <description>3rd Sample Input Select</description>
              <bitRange>[11:8]</bitRange>
            </field>
            <field>
              <name>ADC_SSMUX0_MUX3</name>
              <description>4th Sample Input Select</description>
              <bitRange>[15:12]</bitRange>
            </field>
            <field>
              <name>ADC_SSMUX0_MUX4</name>
              <description>5th Sample Input Select</description>
              <bitRange>[19:16]</bitRange>
            </field>
            <field>
              <name>ADC_SSMUX0_MUX5</name>
              <description>6th Sample Input Select</description>
              <bitRange>[23:20]</bitRange>
            </field>
            <field>
              <name>ADC_SSMUX0_MUX6</name>
              <description>7th Sample Input Select</description>
              <bitRange>[27:24]</bitRange>
            </field>
            <field>
              <name>ADC_SSMUX0_MUX7</name>
              <description>8th Sample Input Select</description>
              <bitRange>[31:28]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SSCTL0</name>
          <description>ADC Sample Sequence Control 0</description>
          <addressOffset>0x00000044</addressOffset>
          <fields>
            <field>
              <name>ADC_SSCTL0_D0</name>
              <description>1st Sample Diff Input Select</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ADC_SSCTL0_END0</name>
              <description>1st Sample is End of Sequence</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>ADC_SSCTL0_IE0</name>
              <description>1st Sample Interrupt Enable</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>ADC_SSCTL0_TS0</name>
              <description>1st Sample Temp Sensor Select</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>ADC_SSCTL0_D1</name>
              <description>2nd Sample Diff Input Select</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>ADC_SSCTL0_END1</name>
              <description>2nd Sample is End of Sequence</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>ADC_SSCTL0_IE1</name>
              <description>2nd Sample Interrupt Enable</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>ADC_SSCTL0_TS1</name>
              <description>2nd Sample Temp Sensor Select</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>ADC_SSCTL0_D2</name>
              <description>3rd Sample Diff Input Select</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>ADC_SSCTL0_END2</name>
              <description>3rd Sample is End of Sequence</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>ADC_SSCTL0_IE2</name>
              <description>3rd Sample Interrupt Enable</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>ADC_SSCTL0_TS2</name>
              <description>3rd Sample Temp Sensor Select</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>ADC_SSCTL0_D3</name>
              <description>4th Sample Diff Input Select</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>ADC_SSCTL0_END3</name>
              <description>4th Sample is End of Sequence</description>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>ADC_SSCTL0_IE3</name>
              <description>4th Sample Interrupt Enable</description>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ADC_SSCTL0_TS3</name>
              <description>4th Sample Temp Sensor Select</description>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>ADC_SSCTL0_D4</name>
              <description>5th Sample Diff Input Select</description>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>ADC_SSCTL0_END4</name>
              <description>5th Sample is End of Sequence</description>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>ADC_SSCTL0_IE4</name>
              <description>5th Sample Interrupt Enable</description>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>ADC_SSCTL0_TS4</name>
              <description>5th Sample Temp Sensor Select</description>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>ADC_SSCTL0_D5</name>
              <description>6th Sample Diff Input Select</description>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>ADC_SSCTL0_END5</name>
              <description>6th Sample is End of Sequence</description>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>ADC_SSCTL0_IE5</name>
              <description>6th Sample Interrupt Enable</description>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>ADC_SSCTL0_TS5</name>
              <description>6th Sample Temp Sensor Select</description>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>ADC_SSCTL0_D6</name>
              <description>7th Sample Diff Input Select</description>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>ADC_SSCTL0_END6</name>
              <description>7th Sample is End of Sequence</description>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>ADC_SSCTL0_IE6</name>
              <description>7th Sample Interrupt Enable</description>
              <bitRange>[26:26]</bitRange>
            </field>
            <field>
              <name>ADC_SSCTL0_TS6</name>
              <description>7th Sample Temp Sensor Select</description>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>ADC_SSCTL0_D7</name>
              <description>8th Sample Diff Input Select</description>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>ADC_SSCTL0_END7</name>
              <description>8th Sample is End of Sequence</description>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>ADC_SSCTL0_IE7</name>
              <description>8th Sample Interrupt Enable</description>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>ADC_SSCTL0_TS7</name>
              <description>8th Sample Temp Sensor Select</description>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SSFIFO0</name>
          <description>ADC Sample Sequence Result FIFO 0</description>
          <addressOffset>0x00000048</addressOffset>
          <fields>
            <field>
              <name>ADC_SSFIFO0_DATA</name>
              <description>Conversion Result Data</description>
              <bitRange>[11:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SSFSTAT0</name>
          <description>ADC Sample Sequence FIFO 0 Status</description>
          <addressOffset>0x0000004C</addressOffset>
          <fields>
            <field>
              <name>ADC_SSFSTAT0_TPTR</name>
              <description>FIFO Tail Pointer</description>
              <bitRange>[3:0]</bitRange>
            </field>
            <field>
              <name>ADC_SSFSTAT0_HPTR</name>
              <description>FIFO Head Pointer</description>
              <bitRange>[7:4]</bitRange>
            </field>
            <field>
              <name>ADC_SSFSTAT0_EMPTY</name>
              <description>FIFO Empty</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>ADC_SSFSTAT0_FULL</name>
              <description>FIFO Full</description>
              <bitRange>[12:12]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SSOP0</name>
          <description>ADC Sample Sequence 0 Operation</description>
          <addressOffset>0x00000050</addressOffset>
          <fields>
            <field>
              <name>ADC_SSOP0_S0DCOP</name>
              <description>Sample 0 Digital Comparator Operation</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ADC_SSOP0_S1DCOP</name>
              <description>Sample 1 Digital Comparator Operation</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>ADC_SSOP0_S2DCOP</name>
              <description>Sample 2 Digital Comparator Operation</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>ADC_SSOP0_S3DCOP</name>
              <description>Sample 3 Digital Comparator Operation</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>ADC_SSOP0_S4DCOP</name>
              <description>Sample 4 Digital Comparator Operation</description>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>ADC_SSOP0_S5DCOP</name>
              <description>Sample 5 Digital Comparator Operation</description>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>ADC_SSOP0_S6DCOP</name>
              <description>Sample 6 Digital Comparator Operation</description>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>ADC_SSOP0_S7DCOP</name>
              <description>Sample 7 Digital Comparator Operation</description>
              <bitRange>[28:28]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SSDC0</name>
          <description>ADC Sample Sequence 0 Digital Comparator Select</description>
          <addressOffset>0x00000054</addressOffset>
          <fields>
            <field>
              <name>ADC_SSDC0_S0DCSEL</name>
              <description>Sample 0 Digital Comparator Select</description>
              <bitRange>[3:0]</bitRange>
            </field>
            <field>
              <name>ADC_SSDC0_S1DCSEL</name>
              <description>Sample 1 Digital Comparator Select</description>
              <bitRange>[7:4]</bitRange>
            </field>
            <field>
              <name>ADC_SSDC0_S2DCSEL</name>
              <description>Sample 2 Digital Comparator Select</description>
              <bitRange>[11:8]</bitRange>
            </field>
            <field>
              <name>ADC_SSDC0_S3DCSEL</name>
              <description>Sample 3 Digital Comparator Select</description>
              <bitRange>[15:12]</bitRange>
            </field>
            <field>
              <name>ADC_SSDC0_S4DCSEL</name>
              <description>Sample 4 Digital Comparator Select</description>
              <bitRange>[19:16]</bitRange>
            </field>
            <field>
              <name>ADC_SSDC0_S5DCSEL</name>
              <description>Sample 5 Digital Comparator Select</description>
              <bitRange>[23:20]</bitRange>
            </field>
            <field>
              <name>ADC_SSDC0_S6DCSEL</name>
              <description>Sample 6 Digital Comparator Select</description>
              <bitRange>[27:24]</bitRange>
            </field>
            <field>
              <name>ADC_SSDC0_S7DCSEL</name>
              <description>Sample 7 Digital Comparator Select</description>
              <bitRange>[31:28]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SSEMUX0</name>
          <description>ADC Sample Sequence Extended Input Multiplexer Select 0</description>
          <addressOffset>0x00000058</addressOffset>
          <fields>
            <field>
              <name>ADC_SSEMUX0_EMUX0</name>
              <description>1st Sample Input Select (Upper Bit)</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ADC_SSEMUX0_EMUX1</name>
              <description>2th Sample Input Select (Upper Bit)</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>ADC_SSEMUX0_EMUX2</name>
              <description>3rd Sample Input Select (Upper Bit)</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>ADC_SSEMUX0_EMUX3</name>
              <description>4th Sample Input Select (Upper Bit)</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>ADC_SSEMUX0_EMUX4</name>
              <description>5th Sample Input Select (Upper Bit)</description>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>ADC_SSEMUX0_EMUX5</name>
              <description>6th Sample Input Select (Upper Bit)</description>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>ADC_SSEMUX0_EMUX6</name>
              <description>7th Sample Input Select (Upper Bit)</description>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>ADC_SSEMUX0_EMUX7</name>
              <description>8th Sample Input Select (Upper Bit)</description>
              <bitRange>[28:28]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SSMUX1</name>
          <description>ADC Sample Sequence Input Multiplexer Select 1</description>
          <addressOffset>0x00000060</addressOffset>
          <fields>
            <field>
              <name>ADC_SSMUX1_MUX0</name>
              <description>1st Sample Input Select</description>
              <bitRange>[3:0]</bitRange>
            </field>
            <field>
              <name>ADC_SSMUX1_MUX1</name>
              <description>2nd Sample Input Select</description>
              <bitRange>[7:4]</bitRange>
            </field>
            <field>
              <name>ADC_SSMUX1_MUX2</name>
              <description>3rd Sample Input Select</description>
              <bitRange>[11:8]</bitRange>
            </field>
            <field>
              <name>ADC_SSMUX1_MUX3</name>
              <description>4th Sample Input Select</description>
              <bitRange>[15:12]</bitRange>
            </field>
          </fields>
        </register>
